#### RDBMS- MySQL

## Necessary Modules

In [ ]:
#(** To avoid error ,first uninstall the modules if exists from before. Then install again.)
#pip3 install mysql-connector-python
# pip3 install mysqlclient
# pip3 install ipython-sql
# pip3 install mypy-extensions
# pip3 install SQLAlchemy
# pip3 install PyMySQL

## Creating a database and connecting to it

In [1]:
#Connecting to MySQL database
import mysql.connector as sql
mydb=sql.connect(host="localhost",user="root",passwd="Mahmud")
mycursor = mydb.cursor()

In [ ]:
#Creating a database
mycursor.execute("CREATE DATABASE Problem_set_06")

In [ ]:
#Deleting the database
# mycursor.execute("DROP DATABASE Problem_set_06")

In [2]:
%load_ext sql

In [3]:
#Connecting to the database which was created before
%sql mysql://root:Mahmud@localhost/Problem_set_06

## Schema

![Cat](dataset/schema.png)

## Creating necessary table

In [ ]:
%%sql
CREATE TABLE sales (
  customer_id VARCHAR(1),
  order_date DATE,
  product_id INTEGER
);

In [4]:
%%sql
desc sales

 * mysql://root:***@localhost/Problem_set_06
3 rows affected.

[('customer_id', 'varchar(1)', 'YES', '', None, ''),
 ('order_date', 'date', 'YES', '', None, ''),
 ('product_id', 'int', 'YES', '', None, '')]

In [ ]:
# %%sql
# drop table sales;

In [ ]:
%%sql
CREATE TABLE menu (
  product_id INTEGER,
  product_name VARCHAR(5),
  price INTEGER
);

In [5]:
%%sql
desc menu

 * mysql://root:***@localhost/Problem_set_06
3 rows affected.

[('product_id', 'int', 'YES', '', None, ''),
 ('product_name', 'varchar(5)', 'YES', '', None, ''),
 ('price', 'int', 'YES', '', None, '')]

In [6]:
# %%sql
# drop table menu;

In [7]:
%%sql
CREATE TABLE members (
  customer_id VARCHAR(1),
  join_date DATE
);

 * mysql://root:***@localhost/Problem_set_06
0 rows affected.

[]

In [9]:
%%sql
desc members

 * mysql://root:***@localhost/Problem_set_06
2 rows affected.

[('customer_id', 'varchar(1)', 'YES', '', None, ''),
 ('join_date', 'date', 'YES', '', None, '')]

In [10]:
# %%sql
# drop table members;

## Loading data to the table

In [11]:
%%sql
INSERT INTO sales
  (customer_id, order_date, product_id)
VALUES
  ('A', '2021-01-01', '1'),
  ('A', '2021-01-01', '2'),
  ('A', '2021-01-07', '2'),
  ('A', '2021-01-10', '3'),
  ('A', '2021-01-11', '3'),
  ('A', '2021-01-11', '3'),
  ('B', '2021-01-01', '2'),
  ('B', '2021-01-02', '2'),
  ('B', '2021-01-04', '1'),
  ('B', '2021-01-11', '1'),
  ('B', '2021-01-16', '3'),
  ('B', '2021-02-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-07', '3');

 * mysql://root:***@localhost/Problem_set_06
15 rows affected.

[]

In [12]:
%%sql
INSERT INTO menu
  (product_id, product_name, price)
VALUES
  ('1', 'sushi', '10'),
  ('2', 'curry', '15'),
  ('3', 'ramen', '12');

 * mysql://root:***@localhost/Problem_set_06
3 rows affected.

[]

In [13]:
%%sql
INSERT INTO members
  (customer_id, join_date)
VALUES
  ('A', '2021-01-07'),
  ('B', '2021-01-09');

 * mysql://root:***@localhost/Problem_set_06
2 rows affected.

[]

In [15]:
%%sql
SELECT * FROM sales LIMIT 2;

 * mysql://root:***@localhost/Problem_set_06
2 rows affected.

[('A', datetime.date(2021, 1, 1), 1), ('A', datetime.date(2021, 1, 1), 2)]

In [16]:
%%sql
SELECT * FROM members LIMIT 2;

 * mysql://root:***@localhost/Problem_set_06
2 rows affected.

[('A', datetime.date(2021, 1, 7)), ('B', datetime.date(2021, 1, 9))]

In [17]:
%%sql
SELECT * FROM menu LIMIT 2;

 * mysql://root:***@localhost/Problem_set_06
2 rows affected.

[(1, 'sushi', 10), (2, 'curry', 15)]

### Problem 1:What is the total amount each customer spent at the restaurant?

In [22]:
%%sql
SELECT customer_id,SUM(price) as "Total Spent"
FROM sales INNER JOIN menu
ON sales.product_id=menu.product_id
GROUP BY customer_id

 * mysql://root:***@localhost/Problem_set_06
3 rows affected.

[('A', Decimal('76')), ('B', Decimal('74')), ('C', Decimal('36'))]

### Problem 2: How many days has each customer visited the restaurant?

In [25]:
%%sql
SELECT customer_id,COUNT(order_date) as "Number of visit"
FROM sales
GROUP BY 1

 * mysql://root:***@localhost/Problem_set_06
3 rows affected.

[('A', 6), ('B', 6), ('C', 3)]

### Problem 3:	What was the first item from the menu purchased by each customer?

In [42]:
%%sql
SELECT customer_id,product_name 
FROM sales INNER JOIN menu
ON sales.product_id=menu.product_id
GROUP BY 1

 * mysql://root:***@localhost/Problem_set_06
3 rows affected.

[('A', 'sushi'), ('B', 'curry'), ('C', 'ramen')]

### Problem 4:	What is the most purchased item on the menu and how many times was it purchased by all customers?

In [56]:
%%sql
SELECT product_name as "Most Purchased Product",COUNT(customer_id) as "Total number of purchase"
FROM sales INNER JOIN menu
ON sales.product_id=menu.product_id
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1

 * mysql://root:***@localhost/Problem_set_06
1 rows affected.

[('ramen', 8)]

In [62]:
%%sql
SELECT customer_id,COUNT(product_name) as "Number of Purchase" FROM 
  sales INNER JOIN menu
    ON sales.product_id=menu.product_id
      WHERE product_name="ramen"
        GROUP BY 1

 * mysql://root:***@localhost/Problem_set_06
3 rows affected.

[('A', 3), ('B', 2), ('C', 3)]

### Problem 5:	Which item was the most popular for each customer?

In [7]:
%%sql
SELECT Temp.customer_id,Temp.product_name
FROM (SELECT customer_id,product_name,COUNT(product_name) as val
      FROM sales INNER JOIN menu
      ON sales.product_id=menu.product_id
      GROUP BY 1,2
      ORDER BY val DESC) AS Temp
GROUP BY 1
ORDER BY 1

-- 1. Joining 2 tables. Adding 1 extra column which will contain number of purchase for each food. Then aliasing the whole table as "Temp".
-- 2. Extracting necessary information from "Temp".

 * mysql://root:***@localhost/Problem_set_06
3 rows affected.

[('A', 'ramen'), ('B', 'curry'), ('C', 'ramen')]

### Problem 6:	Which item was purchased first by the customer after they became a member?

In [77]:
%%sql
SELECT sales.customer_id,menu.product_name
FROM sales,members,menu
WHERE sales.customer_id=members.customer_id 
      AND sales.product_id=menu.product_id 
      AND sales.order_date>=members.join_date
GROUP BY 1
ORDER BY 1,sales.order_date

 * mysql://root:***@localhost/Problem_set_06
2 rows affected.

[('A', 'curry'), ('B', 'sushi')]

### Problem 7:	Which item was purchased just before the customer became a member?

In [85]:
%%sql
SELECT sales.customer_id,menu.product_name
FROM sales,members,menu
WHERE sales.customer_id=members.customer_id 
      AND sales.product_id=menu.product_id 
      AND sales.order_date<members.join_date
GROUP BY 1
ORDER BY 1,sales.order_date DESC

 * mysql://root:***@localhost/Problem_set_06
2 rows affected.

[('A', 'sushi'), ('B', 'sushi')]

### Problem 8:	What is the total items and amount spent for each member before they became a member?

In [83]:
%%sql
SELECT sales.customer_id,COUNT(menu.product_name) AS "Total Item",SUM(menu.price) AS "Total Cost"
FROM sales,members,menu
WHERE sales.customer_id=members.customer_id 
      AND sales.product_id=menu.product_id 
      AND sales.order_date<members.join_date
GROUP BY 1
ORDER BY 1

 * mysql://root:***@localhost/Problem_set_06
2 rows affected.

[('A', 2, Decimal('25')), ('B', 3, Decimal('40'))]

### Problem 9: If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In [6]:
%%sql
SELECT Temp.customer_id,SUM(Temp.point) as "Total Points"
FROM (SELECT customer_id,product_name,price,
                                          CASE
                                              WHEN Product_name="sushi" THEN price*20
                                              ELSE price*10
                                           END AS point
      FROM sales,menu
      WHERE sales.product_id=menu.product_id) AS Temp
GROUP BY 1


-- 1. Joining 2 tables. Adding 1 extra column which will contain points. Then aliasing the whole table as "Temp".
-- 2. Extracting necessary information from "Temp".

 * mysql://root:***@localhost/Problem_set_06
3 rows affected.

[('A', Decimal('860')), ('B', Decimal('940')), ('C', Decimal('360'))]

### Problem 10:	In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [5]:
%%sql
SELECT Temp.customer_id,SUM(Temp.points) AS "Total Points"
FROM (SELECT sales.customer_id,sales.order_date,members.join_date,DATE_ADD(join_date, INTERVAL 1 WEEK),menu.product_name,menu.price,
                        CASE
                            WHEN menu.product_name="sushi" THEN menu.price*20
                            WHEN order_date 
                                      BETWEEN members.join_date 
                                         AND DATE_ADD(join_date, INTERVAL 1 WEEK) 
                                           THEN menu.price*20
                            ELSE menu.price*10
                        END AS points
    FROM sales,members,menu
    WHERE sales.customer_id=members.customer_id 
          AND sales.product_id=menu.product_id
          AND order_date<'2021-02-01'           -- Calculating for dates before february
    ORDER BY 1,sales.order_date) AS Temp

GROUP BY 1
ORDER BY 1



-- 1. Joining 3 tables. Adding 2 extra columns, one will contain dates after 1 week interval and another one will contain points. Then aliasing the whole table as "Temp".
-- 2. Extracting necessary information from "Temp".

 * mysql://root:***@localhost/Problem_set_06
2 rows affected.

[('A', Decimal('1370')), ('B', Decimal('940'))]

### Problem 11:

![Cat](dataset/Question_2.png)

In [27]:
%%sql
SELECT Temp.customer_id,Temp.order_date,menu.product_name,menu.price,
    CASE
        WHEN Temp.order_date>=Temp.join_date THEN "Y"
        ELSE "N"
    END AS member
FROM (SELECT sales.customer_id,sales.order_date,members.join_date,sales.product_id
    FROM sales LEFT JOIN members
    ON sales.customer_id=members.customer_id) AS Temp,menu
WHERE Temp.product_id=menu.product_id
ORDER BY 1,Temp.order_date,menu.price DESC

-- 1. Joining two tables using LEFT JOIN and aliasing the table as "Temp".
-- 2. Joing the third table with "Temp" and adding a column to it named "member"

 * mysql://root:***@localhost/Problem_set_06
15 rows affected.

[('A', datetime.date(2021, 1, 1), 'curry', 15, 'N'),
 ('A', datetime.date(2021, 1, 1), 'sushi', 10, 'N'),
 ('A', datetime.date(2021, 1, 7), 'curry', 15, 'Y'),
 ('A', datetime.date(2021, 1, 10), 'ramen', 12, 'Y'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y'),
 ('B', datetime.date(2021, 1, 1), 'curry', 15, 'N'),
 ('B', datetime.date(2021, 1, 2), 'curry', 15, 'N'),
 ('B', datetime.date(2021, 1, 4), 'sushi', 10, 'N'),
 ('B', datetime.date(2021, 1, 11), 'sushi', 10, 'Y'),
 ('B', datetime.date(2021, 1, 16), 'ramen', 12, 'Y'),
 ('B', datetime.date(2021, 2, 1), 'ramen', 12, 'Y'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N'),
 ('C', datetime.date(2021, 1, 7), 'ramen', 12, 'N')]